nozzleMesh_CASE/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001; //1 = m, 0.001 = mm etc.

vertices //points for constructing mesh
(
	// vertices for inner 3 mm mesh
	(1.0605 1.0605 0.0)			//0
	(-1.0605 1.0605 0.0)		//1
	(-1.0605 -1.0605 0.0)		//2
	(1.0605 -1.0605 0.0)		//3

	(1.0605 1.0605 22.5)		//4
	(-1.0605 1.0605 22.5)		//5
	(-1.0605 -1.0605 22.5)		//6
	(1.0605 -1.0605 22.5)		//7
	
	// vertices for 3-7 mm inner mesh for z 0-1.5 mm
	(2.475 2.475 0.0)			//8
	(-2.475 2.475 0.0)			//9
	(-2.475 -2.475 0.0)			//10
	(2.475 -2.475 0.0)			//11

	(1.0605 1.0605 1.5)			//12
	(-1.0605 1.0605 1.5)		//13
	(-1.0605 -1.0605 1.5)		//14
	(1.0605 -1.0605 1.5)		//15

	(2.475 2.475 1.5)			//16				NEW
	(-2.475 2.475 1.5)			//17
	(-2.475 -2.475 1.5)			//18
	(2.475 -2.475 1.5)			//19

	//vertices for 3-7 mm inner mesh for z 1.5-22.5 mm
	(2.475 2.475 22.5)			//20
	(-2.475 2.475 22.5)			//21
	(-2.475 -2.475 22.5)		//22
	(2.475 -2.475 22.5)			//23

	//vertices for 7-14 mm for z 0-1.5 mm
	(4.9495 4.9495 0.0)			//24
	(-4.9495 4.9495 0.0)		//25
	(-4.9495 -4.9495 0.0)		//26
	(4.9495 -4.9495 0.0)		//27

	(4.9495 4.9495 1.5)			//28
	(-4.9495 4.9495 1.5)		//29
	(-4.9495 -4.9495 1.5)		//30
	(4.9495 -4.9495 1.5)		//31

	//vertices for 10-14 mm for z 1.5-22.5 mm
	(3.5355 3.5355 1.5)			//32
	(-3.5355 3.5355 1.5)		//33
	(-3.5355 -3.5355 1.5)		//34
	(3.5355 -3.5355 1.5)		//35
	
	(3.5355 3.5355 23)			//36
	(-3.5355 3.5355 23)			//37
	(-3.5355 -3.5355 23)		//38
	(3.5355 -3.5355 23)			//39

	(4.9495 4.9495 23)			//40
	(-4.9495 4.9495 23)			//41
	(-4.9495 -4.9495 23)		//42
	(4.9495 -4.9495 23)			//43

	//additional vertices to fix face problem (d10 at z 0)
	(3.5355 3.5355 0.0)			//44
	(-3.5355 3.5355 0.0)		//45
	(-3.5355 -3.5355 0.0)		//46
	(3.5355 -3.5355 0.0)		//47

	//vertices for top cover
	(3.5355 3.5355 25)			//48
	(-3.5355 3.5355 25)			//49
	(-3.5355 -3.5355 25)		//50
	(3.5355 -3.5355 25)			//51

	(4.9495 4.9495 25)			//52
	(-4.9495 4.9495 25)			//53
	(-4.9495 -4.9495 25)		//54
	(4.9495 -4.9495 25)			//55

);

blocks //create mesh blocks from vertices
(
	//core 3 mm
    hex (0 1 2 3 12 13 14 15) (7 7 5) simpleGrading (1 1 1)			//0
	hex (12 13 14 15 4 5 6 7) (7 7 10) simpleGrading (1 1 1)		//1 make this!

	//core 3-7 mm
	hex (0 3 11 8 12 15 19 16) (7 4 5) simpleGrading (1 1 1)		//2
	hex (1 0 8 9 13 12 16 17) (7 4 5) simpleGrading (1 1 1)			//3
	hex (2 1 9 10 14 13 17 18) (7 4 5) simpleGrading (1 1 1)		//4
	hex (3 2 10 11 15 14 18 19) (7 4 5) simpleGrading (1 1 1)		//5

	hex (12 15 19 16 4 7 23 20) (7 4 10) simpleGrading (1 1 1)		//6
	hex (13 12 16 17 5 4 20 21) (7 4 10) simpleGrading (1 1 1)		//7
	hex (14 13 17 18 6 5 21 22) (7 4 10) simpleGrading (1 1 1)		//8
	hex (15 14 18 19 7 6 22 23) (7 4 10) simpleGrading (1 1 1)		//9

	//7-10 mm for z 0-1.5 mm
	hex (8 11 47 44 16 19 35 32) (7 3 5) simpleGrading (1 1 1)		//10
	hex (9 8 44 45 17 16 32 33) (7 3 5) simpleGrading (1 1 1)		//11
	hex (10 9 45 46 18 17 33 34) (7 3 5) simpleGrading (1 1 1)		//12
	hex (11 10 46 47 19 18 34 35) (7 3 5) simpleGrading (1 1 1)		//13

	//10-14 mm for z 0-1.5 mm
	hex (44 47 27 24 32 35 31 28) (7 6 5) simpleGrading (1 1 1)		//14
	hex (45 44 24 25 33 32 28 29) (7 6 5) simpleGrading (1 1 1)		//15
	hex (46 45 25 26 34 33 29 30) (7 6 5) simpleGrading (1 1 1)		//16
	hex (47 46 26 27 35 34 30 31) (7 6 5) simpleGrading (1 1 1)		//17

	//10-14 mm for z 1.5-22.5 mm
	hex (32 35 31 28 36 39 43 40) (7 6 10) simpleGrading (1 1 1)	//18
	hex (33 32 28 29 37 36 40 41) (7 6 10) simpleGrading (1 1 1)	//19
	hex (34 33 29 30 38 37 41 42) (7 6 10) simpleGrading (1 1 1)	//20
	hex (35 34 30 31 39 38 42 43) (7 6 10) simpleGrading (1 1 1)	//21

	//blocks for top cover
	hex (36 39 43 40 48 51 55 52) (7 6 5) simpleGrading (1 1 1)	//22
	hex (37 36 40 41 49 48 52 53) (7 6 5) simpleGrading (1 1 1)	//23
	hex (38 37 41 42 50 49 53 54) (7 6 5) simpleGrading (1 1 1)	//24
	hex (39 38 42 43 51 50 54 55) (7 6 5) simpleGrading (1 1 1)	//25
	hex (36 37 38 39 48 49 50 51) (7 7 5) simpleGrading (1 1 1)	//26 (middle)
);

edges //define custom edge types
(
    // arcs for inner 3 mm of mesh
	arc 0 1 (0.0 1.3 0.0)
	arc 1 2 (-1.3 0.0 0.0)
	arc 2 3 (0.0 -1.3 0.0)
	arc 3 0 (1.3 0.0 0.0)
	
	arc 12 13 (0.0 1.3 1.5)
	arc 13 14 (-1.3 0.0 1.5)
	arc 14 15 (0.0 -1.3 1.5)
	arc 15 12 (1.3 0.0 1.5)

	arc 4 5 (0.0 1.3 22.5)
	arc 5 6 (-1.3 0.0 22.5)
	arc 6 7 (0.0 -1.3 22.5)
	arc 7 4 (1.3 0.0 22.5)

	// arcs for 3-7mm inner mesh for z 0-1.5 mm
	arc 8 9 (0.0 3.5 0.0)
	arc 9 10 (-3.5 0.0 0.0)
	arc 10 11 (0.0 -3.5 0.0)
	arc 11 8 (3.5 0.0 0.0)

	arc 16 17 (0.0 3.5 1.5)	
	arc 17 18 (-3.5 0.0 1.5)
	arc 18 19 (0.0 -3.5 1.5)
	arc 19 16 (3.5 0.0 1.5)

	// arcs for 3-7 mm inner mesh for z 1.5-22.5
	arc 20 21 (0.0 3.5 22.5)
	arc 21 22 (-3.5 0.0 22.5)
	arc 22 23 (0.0 -3.5 22.5)
	arc 23 20 (3.5 0.0 22.5)

	// arcs for 7-10 mm at z 0-1.5 mm
	arc 44 45 (0.0 5.0 0.0)
	arc 45 46 (-5.0 0.0 0.0)
	arc 46 47 (0.0 -5.0 0.0)
	arc 47 44 (5.0 0.0 0.0)

	arc 32 33 (0.0 5.0 1.5)
	arc 33 34 (-5.0 0.0 1.5)
	arc 34 35 (0.0 -5.0 1.5)
	arc 35 32 (5.0 0.0 1.5)

	// arcs for 10-14 mm for z 0-1.5 mm 
	arc 24 25 (0.0 7.0 0.0)
	arc 25 26 (-7.0 0.0 0.0)
	arc 26 27 (0.0 -7.0 0.0)
	arc 27 24 (7.0 0.0 0.0)

	arc 28 29 (0.0 7.0 1.5)
	arc 29 30 (-7.0 0.0 1.5)
	arc 30 31 (0.0 -7.0 1.5)
	arc 31 28 (7.0 0.0 1.5)

	// arcs for 10 mm at z 22.5 mm
	arc 36 37 (0.0 5.0 23)
	arc 37 38 (-5.0 0.0 23)
	arc 38 39 (0.0 -5.0 23)
	arc 39 36 (5.0 0.0 23)

	//arcs for 14mm at z 22.5 mm
	arc 40 41 (0.0 7.0 23)
	arc 41 42 (-7.0 0.0 23)
	arc 42 43 (0.0 -7.0 23)
	arc 43 40 (7.0 0.0 23)

	//arcs for top cover
	arc 52 53 (0.0 7.0 25) 	//outer
	arc 53 54 (-7.0 0.0 25)
	arc 54 55 (0.0 -7.0 25)
	arc 55 52 (7.0 0.0 25)

	arc 48 49 (0.0 5.0 25) 	//inner
	arc 49 50 (-5.0 0.0 25)
	arc 50 51 (0.0 -5.0 25)
	arc 51 48 (5.0 0.0 25)

	
);

boundary //define patches, walls, empty etc.
(
    // right hand rule, thumb points into domain
	
	inlet
	{
		type patch;
		faces
		(
			(5 4 7 6)
			(4 5 21 20)
			(5 6 22 21)
			(6 7 23 22)
			(7 4 20 23)
		);
	}

	extruderWall
    {
        type wall;
        faces
        (
            (16 20 21 17) //wall inside
			(17 21 22 18)
			(18 22 23 19)
			(19 23 20 16)			
			(32 33 37 36) //wall outside
			(33 34 38 37)
			(34 35 39 38)
			(35 32 36 39)
			(16 17 33 32) //bottom side
			(17 18 34 33)
			(18 19 35 34)
			(19 16 32 35)
			(36 37 38 39) //top face
        );
    } 

	overset
	{
		type overset; 
		faces
		(
			(0 1 2 3)	//core
			(0 8 9 1)	//inner (3-7 mm)
			(1 9 10 2)
			(2 10 11 3)
			(3 11 8 0)
			(8 11 47 44)	//middle (7-11 mm)
			(9 8 44 45)
			(10 9 45 46)
			(11 10 46 47)
			(44 47 27 24) //outer (11-25 mm)
			(45 44 24 25)
			(46 45 25 26)
			(47 46 26 27)
			(24 27 31 28)	// z 0-12 mm
			(25 24 28 29)
			(26 25 29 30)
			(27 26 30 31)
			(28 31 43 40)	// z 12-40 mm
			(29 28 40 41)
			(30 29 41 42)
			(31 30 42 43)
			(51 50 49 48) //top cover center
			(48 49 53 52) //top cover top edges
			(49 50 54 53)
			(50 51 55 54)
			(51 48 52 55)
			(40 43 55 52) //top cover sides
			(41 40 52 53)
			(42 41 53 54)
			(43 42 54 55)
		);
	}

);

mergePatchPairs
(
);


// ************************************************************************* //