nozzleMesh_CASE/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          161;
        startFace       18298;
    }
    extruderWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          693;
        startFace       18459;
    }
    overset
    {
        type            overset;
        nFaces          1190;
        startFace       19152;
        faces           ( ( 0 1 2 3 ) ( 0 8 9 1 ) ( 1 9 10 2 ) ( 2 10 11 3 ) ( 3 11 8 0 ) ( 8 11 47 44 ) ( 9 8 44 45 ) ( 10 9 45 46 ) ( 11 10 46 47 ) ( 44 47 27 24 ) ( 45 44 24 25 ) ( 46 45 25 26 ) ( 47 46 26 27 ) ( 24 27 31 28 ) ( 25 24 28 29 ) ( 26 25 29 30 ) ( 27 26 30 31 ) ( 28 31 43 40 ) ( 29 28 40 41 ) ( 30 29 41 42 ) ( 31 30 42 43 ) ( 51 50 49 48 ) ( 48 49 53 52 ) ( 49 50 54 53 ) ( 50 51 55 54 ) ( 51 48 52 55 ) ( 40 43 55 52 ) ( 41 40 52 53 ) ( 42 41 53 54 ) ( 43 42 54 55 ) );
    }
)

// ************************************************************************* //
