nozzleMesh_CASE/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (sika air); //define phase names with space inbetween
//nu0 = 0.65853, tau0 = 0.06504, k = 0.00813, n=1
//tau0 is yield stress divided by density
//k is kinematic viscosity from threshold
//nu0 = k + tau/critical-shear-rate, csr 0.05-0.1
sika
{
    transportModel  HerschelBulkley; //define fluid model
    HerschelBulkleyCoeffs
    {
        nu0      [ 0 2 -1 0 0 0 0 ] 0.65853;
        tau0     [ 0 2 -2 0 0 0 0 ] 0.06504;
        k        [ 0 2 -1 0 0 0 0 ] 0.00813;
        n        [ 0 0  0 0 0 0 0 ] 1;          //n=1 gives Bingham plastic special case of HerschelBulkley
    } 
    rho         1240;
}

air
{
    transportModel  Newtonian; //define fluid model
    nu              1.48e-05; //define kinematic viscosity, try 1 with 0.01 for rho
    rho             1; //define density kg/m3
}

sigma            0.07; //surface tension between phases


// ************************************************************************* //
